In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
territories=["AS","GU","MP","PR","VI"]

# Cleanup data - 2000

## Read in the CSV as a DataFrame

In [3]:
h2000 = pd.read_csv("../Datasets/2000H.csv")
h2000.head()

  State Democratic General Republican General Other General
0    AL            485,660            849,229       104,105
1    AK             45,372            190,862        38,159
2    AS              5,500                NaN         3,505
3    AZ            557,849            854,715        53,092
4    AR            355,366            277,146           253

## Rename the columns since we don't care about the candidate's name

In [4]:
h2000 = h2000.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other General":"Others"})
h2000.head()

  State Democratic Republican   Others
0    AL    485,660    849,229  104,105
1    AK     45,372    190,862   38,159
2    AS      5,500        NaN    3,505
3    AZ    557,849    854,715   53,092
4    AR    355,366    277,146      253

## See if there are any N/A rows and to see how the Total designation looks.

In [5]:
h2000.tail()

     State  Democratic  Republican     Others
51      WA   1,245,872     997,877    138,662
52      WV     420,784     108,769     50,319
53      WI   1,187,866   1,311,447      7,001
54      WY      60,638     141,848      9,826
55  Total:  46,595,202  46,738,619  6,125,773

## Drop any N/A rows and rename the "State" for the total to simply "Total" without any colons or spaces.

In [6]:
h2000 = h2000.dropna(subset=['State'])
h2000 = h2000.fillna("0")
h2000[-1:]["State"]
h2000["State"] = h2000["State"].replace(h2000[-1:]["State"],"Total")
h2000.tail()

    State  Democratic  Republican     Others
51     WA   1,245,872     997,877    138,662
52     WV     420,784     108,769     50,319
53     WI   1,187,866   1,311,447      7,001
54     WY      60,638     141,848      9,826
55  Total  46,595,202  46,738,619  6,125,773

In [7]:
for territory in territories:
    h2000 = h2000.loc[h2000["State"] != territory]
len(h2000)

52

## Replace the commas and change to integers.

In [8]:
h2000['Republican'] = h2000['Republican'].str.replace(',', '').astype(int)
h2000['Democratic'] = h2000['Democratic'].str.replace(',', '').astype(int)
h2000['Others'] = h2000['Others'].str.replace(',', '').astype(int)
h2000.head()

  State  Democratic  Republican  Others
0    AL      485660      849229  104105
1    AK       45372      190862   38159
3    AZ      557849      854715   53092
4    AR      355366      277146     253
5    CA     5407163     4446295  584207

## Add the Year and Election type

In [9]:
h2000["Year"] = 2000
h2000["Election"] = "House"
h2000.head()

  State  Democratic  Republican  Others  Year Election
0    AL      485660      849229  104105  2000    House
1    AK       45372      190862   38159  2000    House
3    AZ      557849      854715   53092  2000    House
4    AR      355366      277146     253  2000    House
5    CA     5407163     4446295  584207  2000    House

## Calculate the Percentage of the Democratic Vote

In [10]:
h2000["PercentD"] = (h2000["Democratic"] / (h2000["Republican"] + h2000["Democratic"] + h2000["Others"])) * 100
h2000.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      485660      849229  104105  2000    House  33.749967
1    AK       45372      190862   38159  2000    House  16.535407
3    AZ      557849      854715   53092  2000    House  38.061387
4    AR      355366      277146     253  2000    House  56.160818
5    CA     5407163     4446295  584207  2000    House  51.804336

# Same for 2002

In [11]:
h2002 = pd.read_csv("../Datasets/2002H.csv")
h2002.head()

  State Democratic Republican   Other
0    AL    507,117    694,606  67,079
1    AK     39,357    169,685  18,683
2    AS      4,959        NaN   4,083
3    AZ    472,135    681,922  40,343
4    AR    392,086    283,739  12,451

In [12]:
h2002 = h2002.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2002.head()

  State Democratic Republican  Others
0    AL    507,117    694,606  67,079
1    AK     39,357    169,685  18,683
2    AS      4,959        NaN   4,083
3    AZ    472,135    681,922  40,343
4    AR    392,086    283,739  12,451

In [13]:
h2002.tail()

     State  Democratic  Republican     Others
50      WA     907,440     778,922     52,754
51      WV     264,124     135,505        320
52      WI     676,925     889,146     71,475
53      WY      65,961     110,229      5,962
54  Total:  33,865,154  37,289,707  2,689,665

In [14]:
h2002 = h2002.dropna(subset=['State'])
h2002 = h2002.fillna("0")
h2002[-1:]["State"]
h2002["State"] = h2002["State"].replace(h2002[-1:]["State"],"Total")
h2002.tail()

    State  Democratic  Republican     Others
50     WA     907,440     778,922     52,754
51     WV     264,124     135,505        320
52     WI     676,925     889,146     71,475
53     WY      65,961     110,229      5,962
54  Total  33,865,154  37,289,707  2,689,665

In [15]:
for territory in territories:
    h2002 = h2002.loc[h2002["State"] != territory]
len(h2002)

52

In [16]:
h2002['Republican'] = h2002['Republican'].str.replace(',', '').astype(int)
h2002['Democratic'] = h2002['Democratic'].str.replace(',', '').astype(int)
h2002['Others'] = h2002['Others'].str.replace(',', '').astype(int)
h2002.head()

  State  Democratic  Republican  Others
0    AL      507117      694606   67079
1    AK       39357      169685   18683
3    AZ      472135      681922   40343
4    AR      392086      283739   12451
5    CA     3731081     3225666  301670

In [17]:
h2002["Year"] = 2002
h2002["Election"] = "House"
h2002.head()

  State  Democratic  Republican  Others  Year Election
0    AL      507117      694606   67079  2002    House
1    AK       39357      169685   18683  2002    House
3    AZ      472135      681922   40343  2002    House
4    AR      392086      283739   12451  2002    House
5    CA     3731081     3225666  301670  2002    House

In [18]:
h2002["PercentD"] = (h2002["Democratic"] / (h2002["Republican"] + h2002["Democratic"] + h2002["Others"])) * 100
h2002.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      507117      694606   67079  2002    House  39.968175
1    AK       39357      169685   18683  2002    House  17.282687
3    AZ      472135      681922   40343  2002    House  39.529052
4    AR      392086      283739   12451  2002    House  56.966391
5    CA     3731081     3225666  301670  2002    House  51.403509

# Same for 2004

In [19]:
h2004 = pd.read_csv("../Datasets/2004H.csv")
h2004.head()

  State GENERAL Democratic GENERAL Republican GENERAL Other
0    AL            708,425          1,079,657         4,677
1    AK             67,074            213,216        19,706
2    AS              6,656              5,472           NaN
3    AZ            597,526          1,127,591       146,328
4    AR            426,380            357,840         7,020

In [20]:
h2004 = h2004.rename(columns={"STATE":"State",
                              "GENERAL Republican":"Republican",
                              "GENERAL Democratic":"Democratic",
                              "GENERAL Other":"Others"})
h2004.head()

  State Democratic Republican   Others
0    AL    708,425  1,079,657    4,677
1    AK     67,074    213,216   19,706
2    AS      6,656      5,472      NaN
3    AZ    597,526  1,127,591  146,328
4    AR    426,380    357,840    7,020

In [21]:
h2004.tail()

     State  Democratic  Republican     Others
51      WA   1,608,751   1,095,493     25,751
52      WV     415,396     303,042      3,218
53      WI   1,368,537   1,380,819     72,257
54      WY      99,989     132,107      6,938
55  Total:  53,254,474  56,027,141  5,132,227

In [22]:
h2004 = h2004.dropna(subset=['State'])
h2004 = h2004.fillna("0")
h2004[-1:]["State"]
h2004["State"] = h2004["State"].replace(h2004[-1:]["State"],"Total")
h2004.tail()

    State  Democratic  Republican     Others
51     WA   1,608,751   1,095,493     25,751
52     WV     415,396     303,042      3,218
53     WI   1,368,537   1,380,819     72,257
54     WY      99,989     132,107      6,938
55  Total  53,254,474  56,027,141  5,132,227

In [23]:
for territory in territories:
    h2004 = h2004.loc[h2004["State"] != territory]
len(h2004)

52

In [24]:
h2004['Republican'] = h2004['Republican'].str.replace(',', '').astype(int)
h2004['Democratic'] = h2004['Democratic'].str.replace(',', '').astype(int)
h2004['Others'] = h2004['Others'].str.replace(',', '').astype(int)
h2004.head()

  State  Democratic  Republican  Others
0    AL      708425     1079657    4677
1    AK       67074      213216   19706
3    AZ      597526     1127591  146328
4    AR      426380      357840    7020
5    CA     6223698     5030821  369234

In [25]:
h2004["Year"] = 2004
h2004["Election"] = "House"
h2004.head()

  State  Democratic  Republican  Others  Year Election
0    AL      708425     1079657    4677  2004    House
1    AK       67074      213216   19706  2004    House
3    AZ      597526     1127591  146328  2004    House
4    AR      426380      357840    7020  2004    House
5    CA     6223698     5030821  369234  2004    House

In [26]:
h2004["PercentD"] = (h2004["Democratic"] / (h2004["Republican"] + h2004["Democratic"] + h2004["Others"])) * 100
h2004.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      708425     1079657    4677  2004    House  39.515908
1    AK       67074      213216   19706  2004    House  22.358298
3    AZ      597526     1127591  146328  2004    House  31.928590
4    AR      426380      357840    7020  2004    House  53.887569
5    CA     6223698     5030821  369234  2004    House  53.542931

# Same for 2006

In [27]:
h2006 = pd.read_csv("../Datasets/2006H.csv")
h2006.head()

  State GENERAL Democratic GENERAL Republican GENERAL Other
0    AL            502,046            627,501        10,605
1    AK             93,879            132,743         8,023
2    AS              5,195              4,493         1,345
3    AZ            627,259            771,246        94,645
4    AR            456,569            306,442           NaN

In [28]:
h2006 = h2006.rename(columns={"STATE":"State",
                              "GENERAL Republican":"Republican",
                              "GENERAL Democratic":"Democratic",
                              "GENERAL Other":"Others"})
h2006.head()

  State Democratic Republican  Others
0    AL    502,046    627,501  10,605
1    AK     93,879    132,743   8,023
2    AS      5,195      4,493   1,345
3    AZ    627,259    771,246  94,645
4    AR    456,569    306,442     NaN

In [29]:
h2006.tail()

     State  Democratic  Republican     Others
52      WI   1,003,156   1,040,071     20,186
53      WY      92,324      93,336      7,709
54  Total:  42,255,280  35,657,353  2,542,040
55     NaN         NaN         NaN        NaN
56     NaN         NaN         NaN        NaN

In [30]:
h2006 = h2006.dropna(subset=['State'])
h2006 = h2006.fillna("0")
h2006[-1:]["State"]
h2006["State"] = h2006["State"].replace(h2006[-1:]["State"],"Total")
h2006.tail()

    State  Democratic  Republican     Others
50     WA   1,244,095     798,005     11,956
51     WV     263,822     190,893         98
52     WI   1,003,156   1,040,071     20,186
53     WY      92,324      93,336      7,709
54  Total  42,255,280  35,657,353  2,542,040

In [31]:
for territory in territories:
    h2006 = h2006.loc[h2006["State"] != territory]
len(h2006)

52

In [32]:
h2006['Republican'] = h2006['Republican'].str.replace(',', '').astype(int)
h2006['Democratic'] = h2006['Democratic'].str.replace(',', '').astype(int)
h2006['Others'] = h2006['Others'].str.replace(',', '').astype(int)
h2006.head()

  State  Democratic  Republican  Others
0    AL      502046      627501   10605
1    AK       93879      132743    8023
3    AZ      627259      771246   94645
4    AR      456569      306442       0
5    CA     4720164     3314398  261254

In [33]:
h2006["Year"] = 2006
h2006["Election"] = "House"
h2006.head()

  State  Democratic  Republican  Others  Year Election
0    AL      502046      627501   10605  2006    House
1    AK       93879      132743    8023  2006    House
3    AZ      627259      771246   94645  2006    House
4    AR      456569      306442       0  2006    House
5    CA     4720164     3314398  261254  2006    House

In [34]:
h2006["PercentD"] = (h2006["Democratic"] / (h2006["Republican"] + h2006["Democratic"] + h2006["Others"])) * 100
h2006.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      502046      627501   10605  2006    House  44.033252
1    AK       93879      132743    8023  2006    House  40.008950
3    AZ      627259      771246   94645  2006    House  42.009108
4    AR      456569      306442       0  2006    House  59.837801
5    CA     4720164     3314398  261254  2006    House  56.898128

# Same for 2008

In [35]:
h2008 = pd.read_csv("../Datasets/2008H.csv")
h2008.head()

  State  Democratic  Republican     Other
0    AL    718367.0   1120903.0   15998.0
1    AK    142560.0    158939.0   15479.0
2    AS      7499.0      4350.0     570.0
3    AZ   1055305.0   1021798.0   78591.0
4    AR    415481.0    215196.0  156516.0

In [36]:
h2008 = h2008.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2008.head()

  State  Democratic  Republican    Others
0    AL    718367.0   1120903.0   15998.0
1    AK    142560.0    158939.0   15479.0
2    AS      7499.0      4350.0     570.0
3    AZ   1055305.0   1021798.0   78591.0
4    AR    415481.0    215196.0  156516.0

In [37]:
h2008.tail()

     State  Democratic  Republican     Others
52      WA   1725316.0   1189147.0        NaN
53      WV    432075.0    213339.0      146.0
54      WI   1383536.0   1274987.0   116651.0
55      WY    106758.0    131244.0    11393.0
56  Total:  65028953.0  51958927.0  5971961.0

In [38]:
h2008 = h2008.dropna(subset=['State'])
h2008 = h2008.fillna("0")
h2008[-1:]["State"]
h2008["State"] = h2008["State"].replace(h2008[-1:]["State"],"Total")
h2008.tail()

    State   Democratic   Republican       Others
52     WA  1.72532e+06  1.18915e+06            0
53     WV       432075       213339          146
54     WI  1.38354e+06  1.27499e+06       116651
55     WY       106758       131244        11393
56  Total   6.5029e+07  5.19589e+07  5.97196e+06

In [39]:
for territory in territories:
    h2008 = h2008.loc[h2008["State"] != territory]
len(h2008)

52

In [40]:
h2008['Republican'] = h2008['Republican'].astype(int)
h2008['Democratic'] = h2008['Democratic'].astype(int)
h2008['Others'] = h2008['Others'].astype(int)
h2008.head()

  State  Democratic  Republican  Others
0    AL      718367     1120903   15998
1    AK      142560      158939   15479
3    AZ     1055305     1021798   78591
4    AR      415481      215196  156516
5    CA     7377725     4515372  428982

In [41]:
h2008["Year"] = 2008
h2008["Election"] = "House"
h2008.head()

  State  Democratic  Republican  Others  Year Election
0    AL      718367     1120903   15998  2008    House
1    AK      142560      158939   15479  2008    House
3    AZ     1055305     1021798   78591  2008    House
4    AR      415481      215196  156516  2008    House
5    CA     7377725     4515372  428982  2008    House

In [42]:
h2008["PercentD"] = (h2008["Democratic"] / (h2008["Republican"] + h2008["Democratic"] + h2008["Others"])) * 100
h2008.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      718367     1120903   15998  2008    House  38.720390
1    AK      142560      158939   15479  2008    House  44.974730
3    AZ     1055305     1021798   78591  2008    House  48.954304
4    AR      415481      215196  156516  2008    House  52.780068
5    CA     7377725     4515372  428982  2008    House  59.874028

# Same for 2010

In [43]:
h2010 = pd.read_csv("../Datasets/2010H.csv")
h2010.head()

,STATE,GENERAL ELECTION DEMOCRATIC,GENERAL ELECTION REPUBLICAN,GENERAL ELECTION OTHER
0,AL,"418,957","914,445","34,345"
1,AK,"77,606","175,384","1,345"
2,AS,"6,182","4,422",356
3,AZ,"711,837","900,510","85,798"
4,AR,"317,975","435,422","20,728"

In [44]:
h2010 = h2010.rename(columns={"STATE":"State",
                              "GENERAL ELECTION REPUBLICAN":"Republican",
                              "GENERAL ELECTION DEMOCRATIC":"Democratic",
                              "GENERAL ELECTION OTHER":"Others"})
h2010.head()

  State Democratic Republican  Others
0    AL    418,957    914,445  34,345
1    AK     77,606    175,384   1,345
2    AS      6,182      4,422     356
3    AZ    711,837    900,510  85,798
4    AR    317,975    435,422  20,728

In [45]:
h2010.tail()

     State  Democratic  Republican     Others
51      WA   1,296,502   1,135,166     47,741
52      WV     227,857     283,085      3,431
53      WI     938,690   1,165,761     36,031
54      WY      45,768     131,661      9,540
55  Total:  39,038,317  44,763,085  3,332,746

In [46]:
h2010 = h2010.dropna(subset=['State'])
h2010 = h2010.fillna("0")
h2010[-1:]["State"]
h2010["State"] = h2010["State"].replace(h2010[-1:]["State"],"Total")
h2010.tail()

    State  Democratic  Republican     Others
51     WA   1,296,502   1,135,166     47,741
52     WV     227,857     283,085      3,431
53     WI     938,690   1,165,761     36,031
54     WY      45,768     131,661      9,540
55  Total  39,038,317  44,763,085  3,332,746

In [47]:
for territory in territories:
    h2010 = h2010.loc[h2010["State"] != territory]
len(h2010)

52

In [48]:
h2010['Republican'] = h2010['Republican'].str.replace(',', '').astype(int)
h2010['Democratic'] = h2010['Democratic'].str.replace(',', '').astype(int)
h2010['Others'] = h2010['Others'].str.replace(',', '').astype(int)
h2010.head()

  State  Democratic  Republican  Others
0    AL      418957      914445   34345
1    AK       77606      175384    1345
3    AZ      711837      900510   85798
4    AR      317975      435422   20728
5    CA     5148511     4195588  303774

In [49]:
h2010["Year"] = 2010
h2010["Election"] = "House"
h2010.head()

  State  Democratic  Republican  Others  Year Election
0    AL      418957      914445   34345  2010    House
1    AK       77606      175384    1345  2010    House
3    AZ      711837      900510   85798  2010    House
4    AR      317975      435422   20728  2010    House
5    CA     5148511     4195588  303774  2010    House

In [50]:
h2010["PercentD"] = (h2010["Democratic"] / (h2010["Republican"] + h2010["Democratic"] + h2010["Others"])) * 100
h2010.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      418957      914445   34345  2010    House  30.631177
1    AK       77606      175384    1345  2010    House  30.513299
3    AZ      711837      900510   85798  2010    House  41.918505
4    AR      317975      435422   20728  2010    House  41.075408
5    CA     5148511     4195588  303774  2010    House  53.364208

# Same for 2012

In [51]:
h2012 = pd.read_csv("../Datasets/2012H.csv")
h2012.head()

  State  Democratic  Republican    Other
0    AL    693498.0   1233624.0   6508.0
1    AK     82927.0    185296.0  21581.0
2    AS      7659.0         NaN   5417.0
3    AZ    946994.0   1131663.0  94660.0
4    AR    304770.0    637591.0  95693.0

In [52]:
h2012 = h2012.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2012.head()

  State  Democratic  Republican   Others
0    AL    693498.0   1233624.0   6508.0
1    AK     82927.0    185296.0  21581.0
2    AS      7659.0         NaN   5417.0
3    AZ    946994.0   1131663.0  94660.0
4    AR    304770.0    637591.0  95693.0

In [53]:
h2012.tail()

     State  Democratic  Republican     Others
52      WA   1852870.0   1511131.0        NaN
53      WV    257101.0    384253.0        NaN
54      WI   1445015.0   1401995.0    19040.0
55      WY     57573.0    166452.0    17596.0
56  Total:  60252696.0  58541130.0  5999289.0

In [54]:
h2012 = h2012.dropna(subset=['State'])
h2012 = h2012.fillna("0")
h2012[-1:]["State"]
h2012["State"] = h2012["State"].replace(h2012[-1:]["State"],"Total")
h2012.tail()

    State   Democratic   Republican       Others
52     WA  1.85287e+06  1.51113e+06            0
53     WV       257101       384253            0
54     WI  1.44502e+06    1.402e+06        19040
55     WY        57573       166452        17596
56  Total  6.02527e+07  5.85411e+07  5.99929e+06

In [55]:
for territory in territories:
    h2012 = h2012.loc[h2012["State"] != territory]
len(h2012)

52

In [56]:
h2012['Republican'] = h2012['Republican'].astype(int)
h2012['Democratic'] = h2012['Democratic'].astype(int)
h2012['Others'] = h2012['Others'].astype(int)
h2012.head()

  State  Democratic  Republican  Others
0    AL      693498     1233624    6508
1    AK       82927      185296   21581
3    AZ      946994     1131663   94660
4    AR      304770      637591   95693
5    CA     7392703     4530012  281642

In [57]:
h2012["Year"] = 2012
h2012["Election"] = "House"
h2012.head()

  State  Democratic  Republican  Others  Year Election
0    AL      693498     1233624    6508  2012    House
1    AK       82927      185296   21581  2012    House
3    AZ      946994     1131663   94660  2012    House
4    AR      304770      637591   95693  2012    House
5    CA     7392703     4530012  281642  2012    House

In [58]:
h2012["PercentD"] = (h2012["Democratic"] / (h2012["Republican"] + h2012["Democratic"] + h2012["Others"])) * 100
h2012.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      693498     1233624    6508  2012    House  35.865083
1    AK       82927      185296   21581  2012    House  28.614857
3    AZ      946994     1131663   94660  2012    House  43.573671
4    AR      304770      637591   95693  2012    House  29.359744
5    CA     7392703     4530012  281642  2012    House  60.574293

# Same for 2014

In [59]:
h2014 = pd.read_csv("../Datasets/2014H.csv")
h2014.head()

  State Democratic Republican   Other
0    AL    331,764    704,533  44,583
1    AK    114,602    142,572  22,567
2    AS      5,328      4,306     612
3    AZ    577,947    817,178  72,492
4    AR    254,774    509,631  66,247

In [60]:
h2014 = h2014.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2014.head()

  State Democratic Republican  Others
0    AL    331,764    704,533  44,583
1    AK    114,602    142,572  22,567
2    AS      5,328      4,306     612
3    AZ    577,947    817,178  72,492
4    AR    254,774    509,631  66,247

In [61]:
h2014.tail()

     State  Democratic  Republican     Others
52      WA   1,047,747     981,853        NaN
53      WV     182,484     242,823     14,081
54      WI   1,102,581   1,233,336     19,663
55      WY      37,803     113,038     14,259
56  Total:  36,025,716  40,068,014  3,125,447

In [62]:
h2014 = h2014.dropna(subset=['State'])
h2014 = h2014.fillna("0")
h2014[-1:]["State"]
h2014["State"] = h2014["State"].replace(h2014[-1:]["State"],"Total")
h2014.tail()

    State  Democratic  Republican     Others
52     WA   1,047,747     981,853          0
53     WV     182,484     242,823     14,081
54     WI   1,102,581   1,233,336     19,663
55     WY      37,803     113,038     14,259
56  Total  36,025,716  40,068,014  3,125,447

In [63]:
for territory in territories:
    h2014 = h2014.loc[h2014["State"] != territory]
len(h2014)

52

In [64]:
h2014['Republican'] = h2014['Republican'].str.replace(',', '').astype(int)
h2014['Democratic'] = h2014['Democratic'].str.replace(',', '').astype(int)
h2014['Others'] = h2014['Others'].str.replace(',', '').astype(int)
h2014.head()

  State  Democratic  Republican  Others
0    AL      331764      704533   44583
1    AK      114602      142572   22567
3    AZ      577947      817178   72492
4    AR      254774      509631   66247
5    CA     4067737     2950679  114005

In [65]:
h2014["Year"] = 2014
h2014["Election"] = "House"
h2014.head()

  State  Democratic  Republican  Others  Year Election
0    AL      331764      704533   44583  2014    House
1    AK      114602      142572   22567  2014    House
3    AZ      577947      817178   72492  2014    House
4    AR      254774      509631   66247  2014    House
5    CA     4067737     2950679  114005  2014    House

In [66]:
h2014["PercentD"] = (h2014["Democratic"] / (h2014["Republican"] + h2014["Democratic"] + h2014["Others"])) * 100
h2014.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      331764      704533   44583  2014    House  30.693879
1    AK      114602      142572   22567  2014    House  40.967180
3    AZ      577947      817178   72492  2014    House  39.379961
4    AR      254774      509631   66247  2014    House  30.671569
5    CA     4067737     2950679  114005  2014    House  57.031645

# Same for 2016

In [67]:
h2016 = pd.read_csv("../Datasets/2016H.csv")
h2016.head()

  State Democratic Republican    Other
0    AL    621,911  1,222,018   45,756
1    AK    111,019    155,088   42,091
2    AS      2,740      8,923      171
3    AZ  1,034,687  1,264,378  112,999
4    AR    111,347    760,415  196,815

In [68]:
h2016 = h2016.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2016.head()

  State Democratic Republican   Others
0    AL    621,911  1,222,018   45,756
1    AK    111,019    155,088   42,091
2    AS      2,740      8,923      171
3    AZ  1,034,687  1,264,378  112,999
4    AR    111,347    760,415  196,815

In [69]:
h2016.tail()

     State  Democratic  Republican     Others
52      WA   1,736,145   1,404,890        NaN
53      WV     224,449     445,017     16,883
54      WI   1,379,996   1,270,279    123,387
55      WY      75,466     156,176     20,134
56  Total:  62,315,293  63,422,020  5,915,145

In [70]:
h2016 = h2016.dropna(subset=['State'])
h2016 = h2016.fillna("0")
h2016[-1:]["State"]
h2016["State"] = h2016["State"].replace(h2016[-1:]["State"],"Total")
h2016.tail()

    State  Democratic  Republican     Others
52     WA   1,736,145   1,404,890          0
53     WV     224,449     445,017     16,883
54     WI   1,379,996   1,270,279    123,387
55     WY      75,466     156,176     20,134
56  Total  62,315,293  63,422,020  5,915,145

In [71]:
for territory in territories:
    h2016 = h2016.loc[h2016["State"] != territory]
len(h2016)

52

In [72]:
h2016['Republican'] = h2016['Republican'].str.replace(',', '').astype(int)
h2016['Democratic'] = h2016['Democratic'].str.replace(',', '').astype(int)
h2016['Others'] = h2016['Others'].str.replace(',', '').astype(int)
h2016.head()

  State  Democratic  Republican  Others
0    AL      621911     1222018   45756
1    AK      111019      155088   42091
3    AZ     1034687     1264378  112999
4    AR      111347      760415  196815
5    CA     8624432     4682033  107553

In [73]:
h2016["Year"] = 2016
h2016["Election"] = "House"
h2016.head()

  State  Democratic  Republican  Others  Year Election
0    AL      621911     1222018   45756  2016    House
1    AK      111019      155088   42091  2016    House
3    AZ     1034687     1264378  112999  2016    House
4    AR      111347      760415  196815  2016    House
5    CA     8624432     4682033  107553  2016    House

In [74]:
h2016["PercentD"] = (h2016["Democratic"] / (h2016["Republican"] + h2016["Democratic"] + h2016["Others"])) * 100
h2016.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      621911     1222018   45756  2016    House  32.910829
1    AK      111019      155088   42091  2016    House  36.021973
3    AZ     1034687     1264378  112999  2016    House  42.896333
4    AR      111347      760415  196815  2016    House  10.420119
5    CA     8624432     4682033  107553  2016    House  64.294173

# Same for 2018

In [75]:
h2018 = pd.read_csv("../Datasets/2018H.csv")
h2018.head()

  State Democratic Republican   Other
0    AL    678,687    975,737   5,471
1    AK    131,199    149,779   1,188
2    AS        637      7,194     807
3    AZ  1,179,193  1,139,251  22,826
4    AR    312,978    556,339  19,981

In [76]:
h2018 = h2018.rename(columns={"STATE":"State",
                              "Republican General":"Republican",
                              "Democratic General":"Democratic",
                              "Other":"Others"})
h2018.head()

  State Democratic Republican  Others
0    AL    678,687    975,737   5,471
1    AK    131,199    149,779   1,188
2    AS        637      7,194     807
3    AZ  1,179,193  1,139,251  22,826
4    AR    312,978    556,339  19,981

In [77]:
h2018.tail()

     State  Democratic  Republican     Others
51      WA   1,888,593     899,744    233,614
52      WV     234,568     337,146      6,277
53      WI   1,367,492   1,121,043     83,120
54      WY      59,903     127,963     13,379
55  Total:  61,296,952  50,960,112  2,820,406

In [78]:
h2018 = h2018.dropna(subset=['State'])
h2018 = h2018.fillna("0")
h2018[-1:]["State"]
h2018["State"] = h2018["State"].replace(h2018[-1:]["State"],"Total")
h2018.tail()

    State  Democratic  Republican     Others
51     WA   1,888,593     899,744    233,614
52     WV     234,568     337,146      6,277
53     WI   1,367,492   1,121,043     83,120
54     WY      59,903     127,963     13,379
55  Total  61,296,952  50,960,112  2,820,406

In [79]:
for territory in territories:
    h2018 = h2018.loc[h2018["State"] != territory]
len(h2018)

52

In [80]:
h2018['Republican'] = h2018['Republican'].str.replace(',', '').astype(int)
h2018['Democratic'] = h2018['Democratic'].str.replace(',', '').astype(int)
h2018['Others'] = h2018['Others'].str.replace(',', '').astype(int)
h2018.head()

  State  Democratic  Republican  Others
0    AL      678687      975737    5471
1    AK      131199      149779    1188
3    AZ     1179193     1139251   22826
4    AR      312978      556339   19981
5    CA     8010445     3973396  200681

In [81]:
h2018["Year"] = 2018
h2018["Election"] = "House"
h2018.head()

  State  Democratic  Republican  Others  Year Election
0    AL      678687      975737    5471  2018    House
1    AK      131199      149779    1188  2018    House
3    AZ     1179193     1139251   22826  2018    House
4    AR      312978      556339   19981  2018    House
5    CA     8010445     3973396  200681  2018    House

In [82]:
h2018["PercentD"] = (h2018["Democratic"] / (h2018["Republican"] + h2018["Democratic"] + h2018["Others"])) * 100
h2018.head()

  State  Democratic  Republican  Others  Year Election   PercentD
0    AL      678687      975737    5471  2018    House  40.887345
1    AK      131199      149779    1188  2018    House  46.497097
3    AZ     1179193     1139251   22826  2018    House  50.365528
4    AR      312978      556339   19981  2018    House  35.193827
5    CA     8010445     3973396  200681  2018    House  65.742792

# Inserting changes in Democratic vote to the previous election

In [83]:
change = []
for state in h2002["State"]:
    chg = (h2002.loc[h2002["State"] == state, "PercentD"].iloc[0] - h2000.loc[h2000["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2002["Change"] = change
h2002.head()

  State  Democratic  Republican  Others  Year Election   PercentD    Change
0    AL      507117      694606   67079  2002    House  39.968175  6.218208
1    AK       39357      169685   18683  2002    House  17.282687  0.747280
3    AZ      472135      681922   40343  2002    House  39.529052  1.467665
4    AR      392086      283739   12451  2002    House  56.966391  0.805573
5    CA     3731081     3225666  301670  2002    House  51.403509 -0.400827

In [84]:
change = []
for state in h2004["State"]:
    chg = (h2004.loc[h2004["State"] == state, "PercentD"].iloc[0] - h2002.loc[h2002["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2004["Change"] = change
h2004.head()

  State  Democratic  Republican  Others  Year Election   PercentD    Change
0    AL      708425     1079657    4677  2004    House  39.515908 -0.452267
1    AK       67074      213216   19706  2004    House  22.358298  5.075611
3    AZ      597526     1127591  146328  2004    House  31.928590 -7.600462
4    AR      426380      357840    7020  2004    House  53.887569 -3.078823
5    CA     6223698     5030821  369234  2004    House  53.542931  2.139422

In [85]:
change = []
for state in h2006["State"]:
    chg = (h2006.loc[h2006["State"] == state, "PercentD"].iloc[0] - h2004.loc[h2004["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2006["Change"] = change
h2006.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      502046      627501   10605  2006    House  44.033252   4.517344
1    AK       93879      132743    8023  2006    House  40.008950  17.650652
3    AZ      627259      771246   94645  2006    House  42.009108  10.080518
4    AR      456569      306442       0  2006    House  59.837801   5.950232
5    CA     4720164     3314398  261254  2006    House  56.898128   3.355197

In [86]:
change = []
for state in h2008["State"]:
    chg = (h2008.loc[h2008["State"] == state, "PercentD"].iloc[0] - h2006.loc[h2006["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2008["Change"] = change
h2008.head()

  State  Democratic  Republican  Others  Year Election   PercentD    Change
0    AL      718367     1120903   15998  2008    House  38.720390 -5.312862
1    AK      142560      158939   15479  2008    House  44.974730  4.965780
3    AZ     1055305     1021798   78591  2008    House  48.954304  6.945196
4    AR      415481      215196  156516  2008    House  52.780068 -7.057733
5    CA     7377725     4515372  428982  2008    House  59.874028  2.975900

In [87]:
change = []
for state in h2010["State"]:
    chg = (h2010.loc[h2010["State"] == state, "PercentD"].iloc[0] - h2008.loc[h2008["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2010["Change"] = change
h2010.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      418957      914445   34345  2010    House  30.631177  -8.089213
1    AK       77606      175384    1345  2010    House  30.513299 -14.461431
3    AZ      711837      900510   85798  2010    House  41.918505  -7.035799
4    AR      317975      435422   20728  2010    House  41.075408 -11.704660
5    CA     5148511     4195588  303774  2010    House  53.364208  -6.509820

In [88]:
change = []
for state in h2012["State"]:
    chg = (h2012.loc[h2012["State"] == state, "PercentD"].iloc[0] - h2010.loc[h2010["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2012["Change"] = change
h2012.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      693498     1233624    6508  2012    House  35.865083   5.233906
1    AK       82927      185296   21581  2012    House  28.614857  -1.898442
3    AZ      946994     1131663   94660  2012    House  43.573671   1.655166
4    AR      304770      637591   95693  2012    House  29.359744 -11.715663
5    CA     7392703     4530012  281642  2012    House  60.574293   7.210085

In [89]:
change = []
for state in h2014["State"]:
    chg = (h2014.loc[h2014["State"] == state, "PercentD"].iloc[0] - h2012.loc[h2012["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2014["Change"] = change
h2014.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      331764      704533   44583  2014    House  30.693879  -5.171204
1    AK      114602      142572   22567  2014    House  40.967180  12.352323
3    AZ      577947      817178   72492  2014    House  39.379961  -4.193710
4    AR      254774      509631   66247  2014    House  30.671569   1.311825
5    CA     4067737     2950679  114005  2014    House  57.031645  -3.542649

In [90]:
change = []
for state in h2016["State"]:
    chg = (h2016.loc[h2016["State"] == state, "PercentD"].iloc[0] - h2014.loc[h2014["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2016["Change"] = change
h2016.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      621911     1222018   45756  2016    House  32.910829   2.216950
1    AK      111019      155088   42091  2016    House  36.021973  -4.945207
3    AZ     1034687     1264378  112999  2016    House  42.896333   3.516372
4    AR      111347      760415  196815  2016    House  10.420119 -20.251449
5    CA     8624432     4682033  107553  2016    House  64.294173   7.262529

In [91]:
change = []
for state in h2018["State"]:
    chg = (h2018.loc[h2018["State"] == state, "PercentD"].iloc[0] - h2016.loc[h2016["State"] == state, "PercentD"].iloc[0])
    change.append(chg)
h2018["Change"] = change
h2018.head()

  State  Democratic  Republican  Others  Year Election   PercentD     Change
0    AL      678687      975737    5471  2018    House  40.887345   7.976516
1    AK      131199      149779    1188  2018    House  46.497097  10.475125
3    AZ     1179193     1139251   22826  2018    House  50.365528   7.469195
4    AR      312978      556339   19981  2018    House  35.193827  24.773708
5    CA     8010445     3973396  200681  2018    House  65.742792   1.448619

In [92]:
h_all = h2000.append(h2002, ignore_index=True)
h_all = h_all.append(h2004, ignore_index=True)
h_all = h_all.append(h2006, ignore_index=True)
h_all = h_all.append(h2008, ignore_index=True)
h_all = h_all.append(h2010, ignore_index=True)
h_all = h_all.append(h2012, ignore_index=True)
h_all = h_all.append(h2014, ignore_index=True)
h_all = h_all.append(h2016, ignore_index=True)
h_all = h_all.append(h2018, ignore_index=True)
h_all

,State,Democratic,Republican,Others,Year,Election,PercentD,Change
0,AL,485660,849229,104105,2000,House,33.749967,NaN
1,AK,45372,190862,38159,2000,House,16.535407,NaN
2,AZ,557849,854715,53092,2000,House,38.061387,NaN
3,AR,355366,277146,253,2000,House,56.160818,NaN
4,CA,5407163,4446295,584207,2000,House,51.804336,NaN
...,...,...,...,...,...,...,...,...
515,WA,1888593,899744,233614,2018,House,62.495818,7.222795
516,WV,234568,337146,6277,2018,House,40.583331,7.881455
517,WI,1367492,1121043,83120,2018,House,53.175562,3.421987
518,WY,59903,127963,13379,2018,House,29.766205,-0.207263
519,Total,61296952,50960112,2820406,2018,House,53.265815,5.932636

In [93]:
h_all.to_csv('h_all.csv',index=False)